console.log(`
Самооценка: 150 / 150
1) - [x] Вёрстка валидная. Для проверки валидности вёрстки используйте сервис https://validator.w3.org/. Валидной вёрстке соответствует надпись "Document checking completed. No errors or warnings to show."
2) - [x] header, main, footer
3) - [x] семь элементов section (по количеству секций)
4) - [x] только один заголовок h1
5) - [x] семь заголовков h2 (по количеству секций)
6) - [x] шесть заголовков h3 (по количеству карточек)
7) - [x] два элемента nav (основная и вспомогательная панель навигации)
8) - [x] три списка ul > li > a (основная и вспомогательная панель навигации, ссылки на соцсети)
9) - [x] тринадцать кнопок button (четыре из них в секции Video, пять в секции Tickets, по две - стрелки слайдера и плейлиста)
10) - [x] три тега input type="radio" (в секции Tickets)
11) - [x] два тега input type="number"(в секции Tickets)
12) - [x] два тега input type="range" (громкось и прогрес-бар видео)
13) - [x] для всех элементов img указан обязательный атрибут alt
14) - [x] блок header
15) - [x] секция Welcome
16) - [x] секция Visiting
17) - [x] секция Explore
18) - [x] секция Video
19) - [x] секция Gallery
20) - [x] секция Tickets
21) - [x] секция Contacts
22) - [x] блок footer
23) - [x] форма плавно выдвигается слева при открытии и плавно возвращается назад при закрытии. В открытом состоянии под формой есть полупрозрачный overlay, который занимает весь экран. Форма и overlay прокручиваются вместе со страницей
24) - [x] форма открывается при клике по кнопке Buy Now в секции Tickets и закрывается кликом по иконке с крестиком в верхнем правом углу или кликом по overlay
25) - [x] при вёрстке формы используются следующие элементы: form, input type="date", input type="time", input type="text", input type="email", input type="tel", input type="number", select
26) - [±] вёрстка формы соответствует макету
27) - [x] добавлен favicon
28) - [x] для построения сетки используются флексы или гриды
29) - [x] при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону
30) - [x] фоновый цвет каждого блока и секции тянется на всю ширину страницы
31) - [x] иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления
32) - [x] расстояние между буквами, там, где это требуется по макету, регулируется css-свойством letter-spacing
33) - [x] переключаются радиокнопки в блоке Tickets, одновременно может быть выбрана только одна кнопка
34) - [x] в блоке Contacts правильно указанны ссылки на почту mailto и на телефон tel
35) - [±] в футере добавлены ссылки на соцсети. Круглая граница вокруг иконок соцсетей выполнена при помощи css
36) - [x] плавная прокрутка по якорям
37) - [x] параллакс
38) - [x] при кликам по кнопке Discover the Louvre и карточкам секции Visiting открываются полноэкранные панорамы Google Street View встроенные в страницы вашего сайта при помощи iframe
39) - [x] изменение стиля интерактивных элементов при наведении и клике. Интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты – изменение цвета фона или шрифта, появление подчёркивания и т.д. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили, если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета
40) - [x] обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы
41) - [x] интерактивность при наведении карточек в секции Visiting предусматривает плавное растягивание подчёркивания заголовка карточки на всю ширину карточки
42) - [x] интерактивность при наведении иконок социальных сетей в футере предусматривает изменение цвета иконки и круглой границы вокруг иконки на золотистый
43) - [x] можно передвигать ползунки громкости и прогресс-бара видео, при этом цвет шкалы до и после ползунка отличается и соответствует макету
44) - [x] кликами по кнопкам + и - в секции Tiskets можно менять количество билетов Basic и Senior от 0 до 20
45) - [x] кнопке "Book" в форме покупки билетов добавлен ripple-эффект. Демо: https://50projects50days.com/projects/button-ripple-effect/
46) - [x] при перезагрузке (обновлении) страницы картины в блоке Galery отображаются в рандомном порядке
`);